[{"ticket_id": 1277553, "title": "firefox keeps going back to previous page randomly , but i have not changed anything", "content": "<p>i have the same OS and all else is same, but recently firefox keeps going back to the previous page randomly , and i have to click that forward arrow to get it back. a real pain as it reloads and i have to start over from what i was reading/copy-pasting etc.\nPerhaps it's a bug with a recent firefox update?\n</p>", "timestamp": "1579272250", "tags": {"0": ["firefox-720", "desktop", "fix-problems", "mac-os", "mac-os-x-1011"]}}, {"ticket_id": 1277548, "title": "How do I turn off Safesearch?", "content": "<p>HO DO I TURN THE FUCKING SAFE SEARCH OFF ON THIS FUCKING COMPUTER FOR THE 100TH TIME!!!!!\n</p>", "timestamp": "1579265568", "tags": {"0": ["privacy-and-security_1", "firefox-720", "desktop", "windows-10"]}}, {"ticket_id": 1277546, "title": "Problem running Adobe Animate CC HTML5 interactions locally / offline with Firefox.", "content": "<p>We are experiencing problems running HTML5 interactions developed in Adobe Animate CC, locally and offline with certain browsers, for example, Firefox 72.0.1 and IE 11. The interaction doesn’t work at all, it freezes when we try to attempt to interact with it. The problem occurs we are trying to play this locally on our desktop PC however when we run it online it works perfectly. We believe that the root cause may be the way the browser is handling the script, possibly a security issue – not exactly sure.\n</p><p><br> \nThe attached image is the error message that Firefox is spitting out.\n</p><p>We did test it with the Hosted Libraries is already unchecked in the Publish Settings and still the same outcome.\n</p><p>Has anyone else experienced this and have a solution or workaround?\n</p><p>Thank you in advance.\n</p>", "timestamp": "1579264865", "tags": {"0": ["desktop", "fix-problems", "windows-10"]}}, {"ticket_id": 1277543, "title": "Firefox pdf viewer is not working even when it is selected in applications settings", "content": "<p>So im trying to get the Firefox pdf viewer to work but for some reason everytime i open a pdf it just brings up a pop up asking me if i would like to download it or open it with another program. In settings under applications, pdfs are set to the firefox pdf viewer and i ahve not found anyone else online with this issue that i can tell.\n</p>", "timestamp": "1579251527", "tags": {"0": ["customize", "desktop", "firefox-720", "windows-10"]}}, {"ticket_id": 1277540, "title": "Sorry. We’ve locked your account.", "content": "<p>I'm trying to sync my firefox account but everytime it appears, I have already did what it ask me to do in \"Firefox Sync Verification Email FAQs\" what do I do now? I need my bookmarks, GOD PLEASE.\n</p>", "timestamp": "1579247577", "tags": {"0": ["firefox-720", "desktop", "sync", "linux"]}}, {"ticket_id": 1277537, "title": "bookmarks library is unreadable. font-size is around 7pts.", "content": "<p>Prior to FF 72 I was able to increase the font-size of all elements of a skin/theme with userchrome.css, but this no longer works. Now, only the captions and menus are affected by the following code.\n</p>\n<ul><li>{\n</li></ul>\n<pre>   font-family:sans-serif !important;\n   font-weight:500 !important;\n   font-size:16px !important;\n   text-shadow:none; !important;\n</pre>\n<p>}\n</p><p>Is there an additional css code snippet that works on the bookmarks library view? Please see the attached image\n</p>", "timestamp": "1579245529", "tags": {"0": ["other", "firefox-720", "desktop"]}}, {"ticket_id": 1277535, "title": "Firefox only prints the first page of multi-page HTML document", "content": "<p>Hey everyone,\n</p><p>For some reason, when I try to print HTML documents from Firefox, it is only printing the first page.  This is not affecting ALL webpages, but it is affecting MOST.  \n</p><p>If I try printing the same HTML page from another browser, it prints all pages without difficulty.  But in Firefox, the print preview screen will show 'page 1 of 2', and the second page will be blank. \n</p><p>Is there anything I can do to fix this?\n</p>", "timestamp": "1579244027", "tags": {"0": ["other", "firefox-720", "desktop", "windows-10"]}}, {"ticket_id": 1277530, "title": "secure search search engine not in win 10", "content": "<p>i have McAfee suite advisor, secure search does not show in my search engine list, win 10\n</p>", "timestamp": "1579238262", "tags": {"0": ["privacy-and-security_1", "firefox-720", "desktop", "firefox-7201", "windows-10"]}}, {"ticket_id": 1277529, "title": "Since new update, I cannot post comments on the NYT Web Site. I have to use Chrome. Firefox just recyles though NYT Logons if I try to post a comment.", "content": "<p>The new update caused this problem. Will be switching to Chrome which works.  All firefox does if I try to post a cmments is to just recycle me through the logon page. I have no problem read the paper but I can no longer post comments. Developers PLEASE fix this new BUG.\n</p>", "timestamp": "1579237872", "tags": {"0": ["websites", "firefox-720", "desktop", "windows-7"]}}, {"ticket_id": 1277528, "title": "Unable to play mp4 files", "content": "<p>I don't know if this is a Firefox problem or Windows 10.\nWhen I receive an mp4 file in gmail on the browser and click on it, it doesn't seem to know what to do. The file association in my windows version is set to play them with the microsoft app, and I can play the video if I download it first.\nThe error message is attached;\nAny comment ????\n</p>", "timestamp": "1579237801", "tags": {"0": ["other", "firefox-720", "desktop", "firefox-7201", "windows-10"]}}]